#3. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
#Без использования встроенной функции преобразования, без строк.
#in
#88
#out
#1011000
#in
#11
#out
#1011

#a = int(input('Введите число, чтобы я преобразовал его в двоичное: '))
#print('{0:b}'.format(a))
#type = str - не подходит значит(

a = int(input('Введите число, чтобы я преобразовал его в двоичное: '))
